Repository: C-EO/kate
Catalog: po/*/formatplugin.po
Languages: ga, nb

source: Format
ga: Formáid

source: Failed to write a temp file
ga: Theip ar chomhad sealadach a scríobh
nb: Klarte ikke skrive til midlertidig mappe

source: Failed to run git diff: git not installed
ga: Theip ar rith git diff: níl git suiteáilte
nb: Klarte ikke kjøre git diff: git er ikke installert

source: Failed to run git diff: %1
ga: Theip ar rith git diff: %1
nb: Klarte ikke kjøre git diff: %1

source: User Settings
ga: Socruithe Úsáideora
nb: Brukerinnstillinger

source: Default Settings
ga: Socruithe Réamhshocraithe
nb: Standardinnstillinger

source: Formatting
ga: Formáidiú
nb: Formatering

source: Formatting Settings
ga: Socruithe Formáidithe
nb: Formateringsinnstillinger

source: Failed to read settings.json. Error: %1
ga: Theip ar settings.json a léamh. Earráid: %1
nb: Klarte ikke lese settings.json. Feil: %1

source: Format Document
ga: Formáid an Doiciméid
nb: Formater dokument

source: Format on Save
ga: Formáidigh ar Shábháil
nb: Formater ved lagring

source: Disable formatting on save without persisting it in settings
ga: Díchumasaigh formáidiú ar shábháil gan é a choinneáil sna socruithe
nb: Deaktiver formatering ved lagring uten å endre i innstillinger

source: %1: Unexpected empty command!
ga: %1: Ordú folamh gan choinne!
nb: %1: Uventet tom kommando!

source: %1 is not installed, please install it to be able to format this document!
ga: Níl %1 suiteáilte, suiteáil é le go mbeidh tú in ann an doiciméad seo a fhormáidiú!
nb: %1 er ikke installert. Installer pakken for å kunne formatere dette dokumentet!

source: Please install node and prettier
ga: Suiteáil node agus prettier le do thoil
nb: Installer «node» og «prettier»

source: PrettierFormat: Failed to create temporary file
ga: PrettierFormat: Theip ar chruthú comhad sealadach
nb: PrettierFormat: Klarte ikke opprette midlertidig fil.

source: PrettierFormat: Failed to start 'node': %1
ga: PrettierFormat: Theip ar thosú 'node': %1
nb: PrettierFormat: Klarte ikke å starte «node»: %1

source: Unknown formatterForJson: %1
ga: Formáideoir anaithnidDoJson: %1
nb: Ukjent formatterForJson: %1

source: Unknown formatterForPython: %1
ga: Formáideoir anaithnidDoPython: %1
nb: Ukjent formatterForPython: %1

source: Unknown formatterForYaml: %1, falling back to yamlfmt
ga: Unknown formatterForYaml: %1, ag titim ar ais go yamlfmtmt
nb: Ukjent formatterForYaml: %1, faller tilbake til yamlfmt

source: Failed to run formatter. Unsupported language %1
ga: Theip ar an fhormáideoir a rith. Teanga nach dtacaítear léi %1
nb: Klarte ikke kjøre formaterer: Språket %1 er ikke støttet
