Repository: C-EO/kate
Catalog: po/*/kategpgplugin.po
Languages: ca, ga, nb, pt_br, sl, uk

source: Error! No keys found...
ca: Error! No s'ha trobat cap clau...
ga: Earráid! Níor aimsíodh aon eochracha...
nb: Feil! Fant ingen nøkler …
pt_br: Erro! Nenhuma chave encontrada…
sl: Napaka! Ni najdenih ključev...
uk: Помилка! Не знайдено ключів…

source: Error finding key:
ca: Error en cercar la clau:
ga: Earráid ag aimsiú eochair:
nb: Feil under nøkkelsøk:
pt_br: Erro ao encontrar chave:
sl: Napaka pri iskanju ključa:
uk: Помилка пошуку ключа:

source: Error in symmetric encryption:
ca: Error en l'encriptatge simètric:
ga: Earráid i gcriptiú siméadrach:
nb: Feil i symmetrisk kryptering:
pt_br: Erro na criptografia simétrica:
sl: Napaka v simetričnem šifriranju:
uk: Помилка у симетричному шифруванні:

source: Encryption Failed:
ca: Ha fallat l'encriptatge:
ga: Theip ar an gcriptiú:
nb: Kryptering feilet:
pt_br: A criptografia falhou:
sl: Šifriranje ni uspelo:
uk: Помилка шифрування:

source: GPG Plugin
ca: Connector GPG
ga: Breiseán GPG
nb: GPG-tillegg
pt_br: Plugin GPG
sl: Vtičnik GPG
uk: Додаток GPG

source: GPG Decrypt current document
ca: El GPG desencripta el document actual
ga: GPG Díchriptigh an doiciméad reatha
nb: Dekrypter gjeldende dokument med GPG
pt_br: Descriptografar documento atual com GPG
sl: Dešifriraj trenutni dokument GPG
uk: Розшифровування поточного документа за допомогою GPG

source: GPG Encrypt current document
ca: El GPG encripta el document actual
ga: GPG Criptigh an doiciméad reatha
nb: Krypter gjeldende dokument med GPG
pt_br: Criptografar documento atual com GPG
sl: Šifriraj trenutni dokument GPG
uk: Шифрування поточного документа за допомогою GPG

source: <b>GPG Plugin Settings</b>
ca: <b>Configuració del connector GPG</b>
ga: <b>Socruithe Breiseáin GPG</b>
nb: <b>Innstillinger for GPG-tillegg</b>
pt_br: <b>Configurações do plugin GPG</b>
sl: <b>Nastavitve vtičnika GPG</b>
uk: <b>Параметри додатка GPG</b>

source: Key ID
ca: ID de la clau
ga: Aitheantas Eochrach
nb: Nøkkel-ID
pt_br: ID da chave
sl: ID ključa
uk: Ідентифікатор ключа

source: A search string used to filter keys by available email addresses
ca: Una cadena de cerca usada per a filtrar claus per adreces disponibles de correu electrònic
ga: Teaghrán cuardaigh a úsáidtear chun eochracha a scagadh de réir seoltaí ríomhphoist atá ar fáil
nb: En søkestreng brukt til å filtrere nøkler basert på tilgjengelige epostadresser
pt_br: Um texto de busca usado para filtrar chaves pelos endereços de e-mail disponíveis
sl: Iskalni niz, ki se uporablja za filtriranje ključev po razpoložljivih e-poštnih naslovih
uk: Пошуковий рядок, який буде використано для фільтрування ключів за доступними адресами електронної пошти

source: Selected GPG Key finerprint for encryption
ca: Empremta digital de la clau GPG seleccionada per a l'encriptatge
ga: Méarlorg Eochair GPG roghnaithe le haghaidh criptithe
nb: Valgt GPG-nøkkelfingeravtrykk for kryptering
pt_br: Impressão digital da chave GPG selecionada para criptografia
sl: Izbrani natančnejši odtis ključa GPG za šifriranje
uk: Відбиток вибраного ключа GPG для шифрування

source: <b>To: Email address used for encryption</b>
ca: <b>A: Adreça de correu electrònic utilitzada per a l'encriptatge</b>
ga: <b>Chuig: Seoladh ríomhphoist a úsáidtear le haghaidh criptithe</b>
nb: <b>Til: Epostadresse brukt for kryptering</p>
pt_br: <b>Para: Endereço de e-mail usado para criptografia</b>
sl: <b>Za: e-poštni naslov, ki se uporablja za šifriranje</b>
uk: <b>Адреса електронної пошти «Кому» для шифрування</b>

source: Select an email address to which to encrypt. Only mail addresses associated with your currently selected key fingerprint are available.
ca: Seleccioneu una adreça de correu electrònic a la qual encriptar. Només estan disponibles les adreces de correu associades amb l'empremta digital de la clau seleccionada actualment.
ga: Roghnaigh seoladh ríomhphoist le criptiú chuige. Níl ach seoltaí ríomhphoist a bhaineann le do mhéarlorg eochrach atá roghnaithe agat ar fáil.
nb: Velg en epostadresse som som du skal kryptere til. Det er bare epostadresser tilhørende det aktive nøkkelfingeravtrykket som er tilgjengelige.
pt_br: Selecione um endereço de e-mail que deseja criptografar. Apenas endereços de e-mail associados com sua impressão digital selecionada atualmente estão disponíveis.
sl: Izberite e-poštni naslov, na katerega želite šifrirati. Na voljo so samo e-poštni naslovi, povezani z vašim trenutno izbranim prstnim odtisom ključa.
uk: Виберіть адресу електронної пошти, для якої слід виконати шифрування. Доступними будуть лише адреси електронної пошти із вибраним зараз відбитком ключа.

source: This is your currently selected GPG key fingerprint that will be used for encryption.
ca: Aquesta és la vostra empremta digital de la clau GPG seleccionada que s'utilitzarà per a l'encriptatge.
ga: Seo é an méarlorg eochrach GPG atá roghnaithe agat faoi láthair a úsáidfear le haghaidh criptithe.
nb: Dette er den aktive GPG-nøkkelfingeravtrykket som blir brukt for kryptering.
pt_br: Esta é sua impressão digital GPG atualimente selecionada que será usada para criptografia.
sl: To je vaš trenutno izbrani prstni odtis ključa GPG, ki bo uporabljen za šifriranje.
uk: Це відбиток поточного вибраного ключа GPG, який буде використано для шифрування.

source: Save as ASCII encoded (.asc/.gpg)
ca: Desa com a codificat ASCII (.asc/.gpg)
ga: Sábháil mar ionchódaithe ASCII (.asc/.gpg)
nb: Lagre som ASCII-kode (.asc/.gpg)
pt_br: Salvar com codificação em ASCII (.asc/.gpg)
sl: Shrani kot kodirano ASCII (.asc/.gpg)
uk: Зберегти у кодуванні ASCII (.asc/.gpg)

source: Enable symmetric encryption
ca: Activa l'encriptatge simètric
ga: Cumasaigh criptiú siméadrach
nb: Slå på symmetrisk kryptering
pt_br: Habilitar criptografia simétrica
sl: Omogoči simetrično šifriranje
uk: Увімкнути симетричне шифрування

source: Show only keys for which a private key is available
ca: Mostra només les claus per a les quals hi ha disponible una clau privada
ga: Taispeáin eochracha amháin a bhfuil eochair phríobháideach ar fáil dóibh
nb: Bare vis nøkler som har tilgjengelige private nøkler
pt_br: Exibir somente chaves para as quais uma chave privada está disponível
sl: Prikaži samo ključe, za katere je na voljo zasebni ključ
uk: Показувати лише ключі, для яких доступний закритий ключ

source: Hide Expired Keys
ca: Oculta les claus vençudes
ga: Folaigh Eochracha atá imithe in Éag
nb: Vis utgåtte nøkler
pt_br: Ocultar chaves expiradas
sl: Skrij potekle ključe
uk: Приховати прострочені ключі

source: Attempted double encryption detected! Encrypting more than once is disabled for now...
ca: S'ha detectat un intent d'encriptatge doble! L'encriptatge més d'una vegada està desactivat de moment...
ga: Braitheadh ​​iarracht ar chriptiú dúbailte! Tá criptiú níos mó ná uair amháin díchumasaithe faoi láthair...
nb: Det er oppdaget forsøk på dobbel kryptering! Kryptering mer enn en gang er slått av inntil videre…
pt_br: Tentativa de criptografia dupla detectada! A criptografia dupla está desabilitada por enquanto…
sl: Zaznan poskus dvojnega šifriranja! Šifriranje več kot enkrat je zaenkrat onemogočeno...
uk: Виявлено спробу подвійного шифрування! У поточній версії повторне шифрування вимкнено…

source: Error! No views available...
ca: Error! No hi ha vistes disponibles...
ga: Earráid! Níl aon radharcanna ar fáil...
nb: Feil! Ingen visninger tilgjengelige …
pt_br: Erro! Nenhuma vista disponível…
sl: Napaka! Ni na voljo pogledov...
uk: Помилка! Немає доступних переглядів…

source: Error Decrypting Text! Document is empty...
ga: Earráid ag díchriptiú Téacs! Tá an doiciméad folamh...
nb: Feil ved dekryptering av tekst! Dokumentet er tomt…

source: Error Decrypting Text! No fingerprint selected...
ca: Error en desencriptar el text! No s'ha seleccionat cap empremta digital...
ga: Earráid ag Díchriptiú Téacs! Níl aon mhéarloirg roghnaithe...
nb: Feil ved dekryptering av tekst! Det er ikke valgt fingeravtrykk…
pt_br: Erro ao descriptografar texto! Nenhuma impressão digital selecionada…
sl: Napaka pri dešifriranju besedila! Ni izbranega prstnega odtisa ...
uk: Помилка під час розшифровування тексту! Не вибрано відбитка…

source: Error Decrypting Text! No matching fingerprint found! Or this is not a GPG encrypted text...
ga: Earráid ag Díchriptiú Téacs! Níor aimsíodh aon mhéarloirg chomhoiriúnach! Nó ní téacs criptithe GPG é seo...
nb: Feil ved dekryptering av tekst! Finner ingen samsvarende fingeravtrykk! Eller så er ikke denne teksten kryptert med GPG…

source: Error Decrypting Text!
ca: Error en desencriptar el text!
ga: Earráid ag díchriptiú Téacs!
nb: Feil ved dekryptering av tekst!
pt_br: Erro ao descriptografar texto!
sl: Napaka pri dešifriranju besedila!
uk: Помилка під час розшифровування тексту!

source: Error Encrypting Text! No document available...
ca: Error en encriptar el text! No hi ha cap document disponible...
ga: Earráid ag criptiú Téacs! Níl aon doiciméad ar fáil...
nb: Feil ved kryptering av tekst! Ingen dokumenter tilgjengelige…
pt_br: Erro ao criptografar texto! Nenhum documento disponível…
sl: Napaka pri šifriranju besedila! Ni na voljo nobenega dokumenta...
uk: Помилка під час шифрування тексту! Немає доступного документа…

source: Error Encrypting Text! Document is empty...
ga: Earráid ag criptiú Téacs! Tá an doiciméad folamh...
nb: Feil ved kryptering av tekst! Dokumentet er tomt…

source: Error Encrypting Text! No fingerprint selected...
ca: Error en encriptar el text No s'ha seleccionat cap empremta digital...
ga: Earráid ag criptiú Téacs! Níor roghnaíodh aon mhéarloirg...
nb: Feil ved kryptering av tekst! Det er ikke valgt fingeravtrykk…
pt_br: Erro ao criptografar texto! Nenhuma impressão digital selecionada…
sl: Napaka pri šifriranju besedila! Ni izbranega prstnega odtisa...
uk: Помилка під час шифрування тексту! Не вибрано відбитка…

source: Attempted double encryption detected! Encrypting twice is disabled for now...
ca: S'ha detectat un intent de xifratge doble! Encriptar dues vegades està desactivat per ara...
ga: Braitheadh ​​iarracht ar chriptiú dúbailte! Tá criptiú faoi dhó díchumasaithe faoi láthair...
nb: Det er oppdaget forsøk på dobbel kryptering! Dobbel kryptering er slått av inntil videre…
pt_br: Tentativa de criptografia dupla detectada! A criptografia dupla está desabilitada por enquanto…
sl: Zaznan poskus dvojnega šifriranja! Dvojno šifriranje je zaenkrat onemogočeno ...
uk: Виявлено спробу подвійного шифрування! У поточній версії повторне шифрування вимкнено…

source: Error Encrypting Text! No Matching Fingerprint found...
ga: Earráid ag criptiú Téacs! Níor aimsíodh aon mhéarlorg comhoiriúnach...
nb: Feil ved kryptering av tekst! Finner ikke samsvarende fingeravtrykk…

source: Error Encrypting Text!
ca: Error en encriptar el text!
ga: Earráid ag criptiú Téacs!
nb: Feil ved kryptering av tekst!
pt_br: Erro ao criptografar texto!
sl: Napaka pri šifriranju besedila!
uk: Помилка під час шифрування тексту!

source: Key Fingerprint
ca: Empremta digital de la clau
ga: Méarlorg Eochrach
nb: Nøkkelfingeravtrykk
pt_br: Impressão digital da chave:
sl: Prstni odtis ključa
uk: Відбиток ключа

source: Creation Date
ca: Data de creació
ga: Dáta Cruthaithe
nb: Opprettelsesdato
pt_br: Data de criação
sl: Datum nastanka
uk: Дата створення

source: Expiry Date
ca: Data de venciment
ga: Dáta Éaga
nb: Utløpsdato
pt_br: Data de expiração
sl: Datum poteka veljavnosti
uk: Термін дії

source: Key Length
ca: Longitud de la clau
ga: Fad Eochrach
nb: Nøkkellengde
pt_br: Comprimento da chave
sl: Dolžina ključa
uk: Довжина ключа

source: User IDs
ca: ID d'usuaris
ga: Aitheantais Úsáideora
nb: Bruker-IDer
pt_br: IDs de usuário
sl: ID-ji uporabnikov
uk: Ідентифікатори користувачів
