Repository: C-EO/kate
Catalog: po/*/katekonsoleplugin.po
Languages: nb

# @action
source: &Pipe to Terminal
nb: &Send i rør til terminalen

# @action
source: S&ynchronize Terminal with Current Document
nb: S&ynkroniser terminalen med gjeldende dokument

# @action
source: Run Current Document
nb: Kjør gjeldende dokument

# @action
source: S&how Terminal Panel
nb: Vis &terminalpanel

# @action
source: &Focus Terminal Panel
nb: &Fokuser terminalpanelet

# @action
source: &Split Terminal Vertically
nb: &Splitt terminalvinduet loddrett

# @action
source: &Split Terminal Horizontally
nb: &Splitt terminalvinduet vannrett

# @action
source: &New Terminal Tab
nb: &Ny terminalfane

source: Konsole not installed. Please install konsole to be able to use the terminal.
nb: Konsole er ikke installert. Installer Konsole dersom du vil bruke terminalen.

source: Do you really want to pipe the text to the console? This will execute any contained commands with your user rights.
nb: Er det sikkert at du vil sende teksten rett til konsollet? Dette vil føre til at eventuelle kommandoer som ligger i teksten blir kjørt med dine brukerrettigheter.

source: Pipe to Terminal?
nb: Send i rør til terminalen?

source: Pipe to Terminal
nb: Send i rør til terminalen

source: Not a local file: '%1'
nb: Ikke en lokal fil: «%1»

source: Do you really want to Run the document ? This will execute the following command, with your user rights, in the terminal: '%1'
nb: Er du sikker på at du vil kjøre dokumentet? Dette vil kjøre følgende kommando, med dine brukerrettigheter i terminalvinduet: «%1»

source: Run in Terminal?
nb: Kjøre i terminal?

source: Run
nb: Kjør

# @action
source: &Hide Terminal Panel
nb: &Gjem terminalpanelet

source: Defocus Terminal Panel
nb: Ta fokus vekk fra terminalpanelet

source: Focus Terminal Panel
nb: Fokuser på terminalpanelet

source: Terminal Synchronization Mode
nb: Modus for terminalsynkronisering

source: &Don't synchronize terminal tab with current document
nb: &Ikke synkroniser terminalfanen med gjeldende dokument

source: &Automatically synchronize the current terminal tab with the current document when possible
nb: Synkroniser &automatisk den gjeldende terminalfanen med gjeldende dokument når mulig

source: &Automatically create a terminal tab for the directory of the current document and switch to it
nb: Opprett en terminalfane &automatisk for mappa til det gjeldende dokumentet og bytt til den

source: Run in terminal
nb: Kjør i terminal

source: &Remove extension
nb: Fje&rn etternavn

source: Prefix:
nb: Prefiks:

source: &Show warning next time
nb: Vi&s advarsel neste gang

source: The next time '%1' is executed, make sure a warning window will pop up, displaying the command to be sent to terminal, for review.
nb: Sikre at en advarsel spretter opp, som viser kommandoen som er i ferd med å sendes til terminalen slik at den kan kontrolleres før «%1» kjøres.

source: Set &EDITOR environment variable to 'kate -b'
nb: Sett miljøvariabelen &EDITOR til «kate -b»

source: Important: The document has to be closed to make the console application continue
nb: Viktig: Dokumentet må være lukket for at konsollprogrammet skal fortsette

source: Hide Konsole on pressing 'Esc'
nb: Gjem Konsole ved å trykke på «Escape»

source: This may cause issues with terminal apps that use Esc key, for e.g., vim. Add these apps in the input below (Comma separated list)
nb: Dette kan skape problemer med terminalprogrammer som bruker «Escape»-tasten, f.eks. Vim. Legg til disse programmene nedenfor (skill programnavnene med komma)

source: Terminal Settings
nb: Terminalinnstillinger

source: &Tools
nb: Verk&tøy
