Repository: C-EO/kate
Catalog: po/*/kateexternaltoolsplugin.po
Languages: ga

# External tool name
source: Clang Format Full File
ga: Comhad Iomlán Formáid Clang

# External tool category
source: Tools
ga: Uirlisí

# External tool name
source: Compile and Run cpp
ga: Tiomsaigh agus Rith cpp

# External tool name
source: Go Fmt Full File
ga: Comhad Iomlán Téigh Fmt

# External tool category
source: Go
ga: Téigh

# External tool name
source: GoImports Full File
ga: Comhad Iomlán GoImports

# External tool name
source: Google Selected Text
ga: Téacs Roghnaithe Google

# External tool name
source: Insert UUID
ga: Cuir UUID isteach

# External tool name
source: JSON Format Full File
ga: Comhad Iomlán Formáid JSON

# External tool name
source: Prettier Format Current File
ga: Formáid an Chomhaid Reatha Prettier

# External tool name
source: Qt Quick 2 Preview (qmlscene)
ga: Réamhamharc Qt Quick 2 (qmlscene)

# External tool name
source: Run Shell Script
ga: Rith Script Shell

# External tool name
source: Rust Fmt Full File
ga: Comhad Iomlán Rust Fmt

# External tool name
source: Search KDE API
ga: Cuardaigh API KDE

# External tool name
source: Search Qt API
ga: Cuardaigh API Qt

# External tool name
source: XML Format Full File
ga: Comhad Iomlán Formáid XML

source: This list shows all the configured tools, represented by their menu text.
ga: Taispeánann an liosta seo na huirlisí cumraithe go léir, arna léiriú ag a dtéacs roghchláir.

source: &Add
ga: &Cuir leis

source: &Edit...
ga: &Eagar...

source: &Remove
ga: &Bain

source: Failed to find executable '%1'. Please make sure the executable file exists and that variable names, if used, are correct
ga: Theip ar an gcomhad inrite '%1' a aimsiú. Cinntigh le do thoil go bhfuil an comhad inrite ann agus go bhfuil ainmneacha na n-athróg, má úsáidtear iad, tá siad ceart

source: External Tools
ga: Uirlisí Seachtracha

source: Running %1: %2 %3
ga: Ag rith %1: %2 %3

source: Running %1: %2 %3 with input %4
ga: Ag rith %1: %2 %3 le hionchur %4

source: Data written to stderr:
ga: Sonraí scríofa chuig stderr:

source: %1 crashed
ga: Thuairteáil %1

source: %1 finished with exit code %2
ga: Chríochnaigh %1 le cód scoir %2

source: Starts the external tool '%1'
ga: Tosaíonn sé an uirlis sheachtrach '%1'

source: Edit External Tool
ga: Cuir Uirlis Sheachtrach in Eagar

source: Revert tool to default settings
ga: Cuir an uirlis ar ais chuig na socruithe réamhshocraithe

source: External Tool
ga: Uirlis Sheachtrach

source: You must specify at least a name and an executable
ga: Ní mór duit ainm agus comhad inrite a shonrú ar a laghad

source: With 'Trigger' enabled, at least one mimetype needs to be specified.
ga: Agus 'Trigger' cumasaithe, ní mór cineál mime amháin ar a laghad a shonrú.

source: Select the MimeTypes for which to enable this tool.
ga: Roghnaigh na Cineálacha MIME ar a mbeidh an uirlis seo cumasaithe.

source: Select Mime Types
ga: Roghnaigh Cineálacha Míme

source: Add Tool...
ga: Cuir Uirlis Leis...

source: Add Tool from Defaults
ga: Cuir Uirlis leis ó na Réamhshocruithe

source: Add Category
ga: Cuir Catagóir leis

source: Uncategorized
ga: Gan catagóir

source: New Category
ga: Catagóir Nua

source: New Category %1
ga: Catagóir Nua %1

source: Configure...
ga: Cumraigh...

source: Launch external helper applications
ga: Seoladh feidhmchláir chúnta seachtracha

source: Edit Tool
ga: Uirlis Eagarthóireachta

source: Na&me:
ga: Ainm:

source: The name will be displayed in the 'Tools->External Tools' menu.
ga: Taispeánfar an t-ainm sa roghchlár 'Uirlisí->Uirlisí Seachtracha'.

source: Short name of the tool
ga: Ainm gairid an uirlis

source: Executable:
ga: Inrite:

source: Application or interpreter
ga: Feidhmchlár nó ateangaire

source: Ar&guments:
ga: Argóintí:

source: Command line arguments
ga: Argóintí líne ordaithe

source: &Input:
ga: &Ionchur:

source: Optional standard input
ga: Ionchur caighdeánach roghnach

source: Working directory:
ga: Eolaire oibre:

source: Uses current document path if empty
ga: Úsáideann sé an cosán doiciméad reatha má tá sé folamh

source: Mime &types:
ga: Cineálacha míme:

source: A semicolon-separated list of mime types for which this tool should be available. If empty, the tool is always available.
ga: Liosta de chineálacha mime, scartha le leathstad, ar cheart an uirlis seo a bheith ar fáil dóibh. Má tá sé folamh, bíonn an uirlis ar fáil i gcónaí.

source: Show tool only for given mime types
ga: Taispeáin an uirlis do na cineálacha mime ar leith amháin

source: Opens a dialog that helps in creating a list of mimetypes.
ga: Osclaíonn sé seo dialóg a chabhraíonn le liosta cineálacha mime a chruthú.

source: Save:
ga: Sábháil:

source: Optionally save the current or all modified documents prior to running the command. This is helpful if you want to pass URLs to an application like, for example, an FTP client.
ga: Is féidir leat na doiciméid reatha nó na doiciméid mhodhnaithe go léir a shábháil sula ritheann tú an t-ordú. Tá sé seo úsáideach más mian leat URLanna a chur chuig feidhmchlár cosúil le cliant FTP, mar shampla.

source: None
ga: Dada

source: Current Document
ga: Doiciméad Reatha

source: All Documents
ga: Gach Doiciméad

source: Trigger
ga: Spriocdhíriú

source: Before Save
ga: Roimh Shábháil

source: After Save
ga: Tar éis Sábháil

source: Reload current document after execution
ga: Athlódáil an doiciméad reatha tar éis é a fhorghníomhú

source: O&utput:
ga: Aschur:

source: Ignore
ga: Déan neamhaird de

source: Insert at Cursor Position
ga: Cuir isteach ag Suíomh an Chúrsóra

source: Replace Selected Text
ga: Ionadaigh an Téacs Roghnaithe

source: Replace Current Document
ga: Ionadaigh an Doiciméad Reatha

source: Append to Current Document
ga: Cuir leis an Doiciméad Reatha

source: Insert in New Document
ga: Cuir isteach i nDoiciméad Nua

source: Copy to Clipboard
ga: Cóipeáil chuig an nGearrthaisce

source: Display in Pane
ga: Taispeáin sa Phána

source: Editor command:
ga: Ordú eagarthóra:

source: If you specify a name here, you can invoke the command from the view command line with the_name_you_specified_here. Please do not use spaces or tabs in the name.
ga: Má shonraíonn tú ainm anseo, is féidir leat an t-ordú a ghairm ón líne ordaithe view leis an_ainm_a_shonraigh_tú_anseo. Ná húsáid spásanna ná tabanna san ainm, le do thoil.

source: Optional view command line name
ga: Ainm líne ordaithe radhairc roghnach

source: Output
ga: Aschur

source: Displays output from the external tool
ga: Taispeánann sé aschur ón uirlis sheachtrach

source: &Tools
ga: &Uirlisí

source: Main Toolbar
ga: Príomhbharra Uirlisí
