Repository: C-EO/kate
Catalog: po/*/kate-replicode-plugin.po
Languages: ga

source: Run
ga: Rith

source: Run time (milliseconds):
ga: Am rith (mileasoicindí):

source: Probe level:
ga: Leibhéal tóireadóireachta:

source: User operations layout module:
ga: Modúl leagan amach oibríochtaí úsáideora:

source: User classes file:
ga: Comhad ranganna úsáideora:

source: Base period:
ga: Tréimhse bhunúsach:

source: Reduction core count:
ga: Líon croí laghdaithe:

source: Time core count:
ga: Líon croíleacáin ama:

source: System
ga: Córas

source: Model inertia success rate threshold:
ga: Tairseach ráta rathúlachta táimhe samhail:

source: Model inertia count threshold:
ga: Tairseach comhaireamh táimhe samhail:

source: Targeted pattern extractor delta success rate threshold:
ga: Tairseach ráta rathúlachta delta eastóscóra patrún spriocdhírithe:

source: Minimum simulation time horizon:
ga: Íosmhéid ama insamhalta:

source: Maximum simulation time horizon:
ga: Uasmhéid ama insamhalta:

source: Simulation time horizon:
ga: Léaslíne ama insamhalta:

source: Targeted pattern extractor time horizon:
ga: Léaslíne ama eastóscóra patrún spriocdhírithe:

source: Perf sampling period:
ga: Tréimhse samplála feidhmíochta:

source: Float tolerance:
ga: Caoinfhulaingt snámhphointe:

source: Timer tolerance:
ga: Caoinfhulaingt an lasc ama:

source: Primary time horizon:
ga: Príomhléargas ama:

source: Secondary time horizon:
ga: Léaslíne ama tánaisteach:

source: Notification marker resilience:
ga: Athléimneacht marcóirí fógra:

source: Goal prediction success resilience:
ga: Athléimneacht rathúlachta tuar spriocanna:

source: Debug
ga: Dífhabhtú

source: Debug:
ga: Dífhabhtú:

source: Debug windows:
ga: Fuinneoga dífhabhtaithe:

source: Traces:
ga: Rianta:

source: Composite inputs
ga: Ionchuir chomhchodacha

source: Composite outputs
ga: Aschuir chomhchodacha

source: Model inputs
ga: Ionchuir mhúnla

source: Model outputs
ga: Aschuir samhail

source: Prediction monitoring
ga: Monatóireacht réamhaisnéise

source: Goal monitoring
ga: Monatóireacht sprice

source: Model revision
ga: Athbhreithniú samhail

source: Model/composite injections
ga: Instealltaí samhail/ilchodacha

source: Decompile objects:
ga: Réada a dhíthiomsú:

source: Decompile to file:
ga: Díthiomsú go comhad:

source: Ignore named objects:
ga: Déan neamhaird de réada ainmnithe:

source: Dump objects to file:
ga: Dumpáil rudaí chuig comhad:

source: Test objects:
ga: Réada tástála:

source: Decompile models:
ga: Samhlacha díthiomsaithe:

source: Ignore named models:
ga: Déan neamhaird de mhúnlaí ainmnithe:

source: Dump models to file:
ga: Dumpáil samhlacha chuig comhad:

source: Test models:
ga: Samhlacha tástála:

source: Path to replicode executor:
ga: Cosán chuig forghníomhaitheoir replicode:

source: Replicode configuration
ga: Cumraíocht replicode

source: Run replicode
ga: Rith replicode

source: Stop replicode
ga: Stop an chód atá á mhacasamhlú

source: Replicode Config
ga: Cumraíocht replicode

# shortcut for action
source: Run (%1)
ga: Rith (%1)

# @title:window
source: Active Document Not Found
ga: Níor aimsíodh an Doiciméad Gníomhach

source: Could not find an active document to run.
ga: Níorbh fhéidir doiciméad gníomhach a aimsiú le rith.

# @title:window
source: Empty Document
ga: Doiciméad Folamh

source: Cannot execute an empty document.
ga: Ní féidir doiciméad folamh a fhorghníomhú.

# @title:window
source: File Not Found
ga: Níor aimsíodh an comhad

source: Unable to open source file for reading.
ga: Ní féidir comhad foinse a oscailt le haghaidh léitheoireachta.

# @title:window
source: Replicode Executable Not Found
ga: Níor aimsíodh an comhad inrite Replicode

source: Unable to find replicode executor. Please go to settings and set the path to the Replicode executable.
ga: Ní féidir an forghníomhaitheoir repliccode a aimsiú. Téigh chuig na socruithe agus socraigh an cosán chuig an bhfoilseachán inrite Repliccode.

# @title:window
source: User Operator Library Not Found
ga: Leabharlann Oibreora Úsáideora Gan Aimsiú

source: Unable to find user operator library. Please go to settings and set the path to the library.
ga: Ní féidir leabharlann oibreora an úsáideora a aimsiú. Téigh chuig na socruithe agus socraigh an cosán chuig an leabharlann.

source: Replicode execution failed: %1
ga: Theip ar fhorghníomhú Replicode: %1

source: Replicode execution finished.
ga: Forghníomhú an chóid mhacasamhlaithe críochnaithe.
