Repository: C-EO/kate
Catalog: po/*/katecloseexceptplugin.po
Languages: ga

# NAME OF TRANSLATORS
source: Your names
ga: Do ainmneacha

# EMAIL OF TRANSLATORS
source: Your emails
ga: Do ríomhphoist

# @title:window
source: Close files confirmation
ga: Deimhniú dúnta comhad

# @label:listbox
source: You are about to close the following documents:
ga: Tá tú ar tí na doiciméid seo a leanas a dhúnadh:

# @title:column
source: Document
ga: Doiciméad

# @title:column
source: Location
ga: Suíomh

# option:check
source: Do not ask again
ga: Ná fiafraigh arís

# @action:inmenu
source: Show Confirmation
ga: Taispeáin Deimhniú

# @action:inmenu close docs except the following...
source: Close Except
ga: Dún Seachas

# @action:inmenu close docs like the following...
source: Close Like
ga: Dún Is maith liom

source: Close Except/Like Plugin
ga: Dún Seachas/Is maith liom Breiseán

# @title:window
source: Error
ga: Earráid

# @info:tooltip
source: No files to close ...
ga: Gan aon chomhaid le dúnadh...

# @title:window
source: Done
ga: Déanta

source: %1 file closed
ga: %1 comhad dúnta
