Repository: C-EO/kate
Catalog: po/*/katetextfilter.po
Languages: my

# @info
source: <title>Result of:</title><nl /><pre><code>$ %1 <nl />%2</code></pre>
my: <title>ရလဒ်</title><nl /><pre><code>$ %1 <nl />%2</code></pre>

source: You are not allowed to execute arbitrary external applications. If you want to be able to do this, contact your system administrator.
my: ပြင်ပအပ္ပလီကေးရှင်းများကို သင့်အနေဖြင့်မောင်းနှင်ခွင့်မရှိပါ။ ခွင့်တောင်းရန် စနစ်အုပ်ချုပ်ရေးမှူးကို ဆက်သွယ်ပါ။

source: Access Restrictions
my: သုံးစွဲမှုကန့်သတ်ချက်များ

source: Text Filter
my: စာသားစစ်ထုတ်မှု

source: Usage: textfilter COMMAND
my: အသုံးပြုနည်း - textfilter အမိန့်

source: <qt><p>Usage: <code>textfilter COMMAND</code></p><p>Replace the selection with the output of the specified shell command.</p></qt>
my: <qt><p>အသုံးပြုပုံ <code>textfilter COMMAND</code></p><p>Replace the selection with the output of the specified shell command.</p></qt>

source: Dialog
my: ဒိုင်ယာလော့

source: Open results in a new document
my: ရလဒ်များကို မှတ်တမ်းစာအုပ်အသစ်တွင် ဖွင့်မည်

source: Merge STDOUT and STDERR
my: STDOUT နှင့် STDERR ပေါင်းပြမည်

source: &Tools
my: &ကိရိယာများ
