Repository: C-EO/kate
Catalog: po/*/katecolorpickerplugin.po
Languages: ga, nb

source: Show preview for known color names
ga: Taispeáin réamhamharc d'ainmneacha dathanna aitheanta
nb: Vis forhåndsvisning for kjente fargenavn

source: Also show the color picker for known color names (e.g. skyblue). See https://www.w3.org/TR/SVG11/types.html#ColorKeywords for the list of colors.
ga: Taispeáin an roghnóir dathanna freisin le haghaidh ainmneacha dathanna aitheanta (m.sh. gorm spéir). Féach https://www.w3.org/TR/SVG11/types.html#ColorKeywords le haghaidh liosta na ndathanna.
nb: Vis også fargevelgeren for kjente fargenavn (f.eks. «skyblue»). Se https://www.w3.org/TR/SVG11/types.html#ColorKeywords for en liste over disse fargene.

source: Place preview after text color
ga: Cuir réamhamharc i ndiaidh dath an téacs
nb: Vis forhåndsvisning etter tekstfargen

source: Hex color matching
nb: Oppslag for hex-fargekoder

source: 12 digits (#RRRRGGGGBBBB)
ga: 12 dhigit (#RRRRGGGGBBBB)
nb: 12 siffer (#RRRRGGGGBBBB)

source: 9 digits (#RRRGGGBBB)
ga: 9 ndigit (#RRRGGGBBB)
nb: 9 siffer (#RRRGGGBBB)

source: 8 digits (#AARRGGBB)
ga: 8 ndigit (#AARRGGBB)
nb: 8 siffer (#AARRGGBB)

source: 6 digits (#RRGGBB)
ga: 6 dhigit (#RRGGBB)
nb: 6 siffer (#RRGGBB)

source: 3 digits (#RGB)
ga: 3 dhigit (#RGB)
nb: 3 siffer (#RGB)

source: Color Picker
ga: Roghnóir Dathanna
nb: Fargevelger

source: Color Picker Settings
ga: Socruithe Roghnóra Dathanna
nb: Innstillinger for fargevelger

source: Select Color (Hex output)
ga: Roghnaigh Dath (Aschur Heicseagánach)
nb: Velg farge (hex-format)

source: View Color [Read only]
ga: Dath Amhairc [Léigh amháin]
nb: Vis farge [skrivebeskyttet]
