Repository: C-EO/kate
Catalog: po/*/katekeyboardmacros.po
Languages: ga

source: Could not open file '%1'.
ga: Níorbh fhéidir comhad '%1' a oscailt.

source: Malformed JSON file '%1': %2
ga: Comhad JSON mífhoirmithe '%1': %2

source: Could not load '%1': malformed macro; wiping it.
ga: Níorbh fhéidir '%1' a luchtú: macra mífhoirmithe; á scriosadh.

source: Keyboard Macros
ga: Macraí Méarchláir

source: <b>Keyboard Macros:</b> %1
ga: <b>Macra Méarchláir:</b> %1

source: Can't save macro during recording. Please end recoding first
ga: Ní féidir macra a shábháil le linn taifeadta. Cuir deireadh leis an athchódú ar dtús, le do thoil.

source: Recording…
ga: Taifeadadh…

source: ended
ga: críochnaithe

source: canceled
ga: curtha ar ceal

source: Recording %1
ga: Taifeadadh %1

source: Saved '%1'
ga: Sábháilte '%1'

source: Loaded '%1'
ga: Luchtaithe '%1'

source: Wiped '%1'
ga: Scriosadh '%1'

source: Usage: %1 <name>.
ga: Úsáid: %1 <ainm>.

source: No keyboard macro named '%1' found.
ga: Níor aimsíodh macra méarchláir darb ainm '%1'.

source: Cannot save empty keyboard macro.
ga: Ní féidir macra méarchláir folamh a shábháil.

source: <qt><p>Usage: <code>kmsave &lt;name&gt;</code></p><p>Save current keyboard macro as <code>&lt;name&gt;</code>.</p>%1</qt>
ga: <qt><p>Úsáid: <code>kmsave &lt;name&gt;</code></p><p>Sábháil an macra méarchláir reatha mar <code>&lt;name&gt;</code>.</p>%1</qt>

source: <qt><p>Usage: <code>kmload &lt;name&gt;</code></p><p>Load saved keyboard macro <code>&lt;name&gt;</code> as current macro.</p>%1</qt>
ga: <qt><p>Úsáid: <code>kmload &lt;name&gt;</code></p><p>Lódáil macra méarchláir sábháilte <code>&lt;name&gt;</code> mar mhacra reatha.</p>%1</qt>

source: <qt><p>Usage: <code>kmplay &lt;name&gt;</code></p><p>Play saved keyboard macro <code>&lt;name&gt;</code> without loading it.</p>%1</qt>
ga: <qt><p>Úsáid: <code>kmplay &lt;name&gt;</code></p><p>Seinm macra méarchláir shábháilte <code>&lt;name&gt;</code> gan é a luchtú.</p>%1</qt>

source: <qt><p>Usage: <code>kmwipe &lt;name&gt;</code></p><p>Wipe saved keyboard macro <code>&lt;name&gt;</code>.</p>%1</qt>
ga: <qt><p>Úsáid: <code>kmwipe <name></code></p><p>Scrios macra méarchláir shábháilte <code>&lt;name></code>.</p>%1</qt>

source: &Keyboard Macros
ga: Macraí Méarchláir

source: Record and play keyboard macros.
ga: Taifead agus seinn macraí méarchláir.

source: &Record Macro...
ga: &Taifead Macra...

source: Start/stop recording a macro (i.e., keyboard action sequence).
ga: Tosaigh/stop taifeadadh macra (i.e., seicheamh gníomhartha méarchláir).

source: &Cancel Macro Recording
ga: &Cealaigh Taifeadadh Macra

source: Cancel ongoing recording (and keep the previous macro as the current one).
ga: Cealaigh an taifeadadh atá ar siúl (agus coinnigh an macra roimhe seo mar an macra reatha).

source: &Play Macro
ga: &Seinm Macra

source: Play current macro (i.e., execute the last recorded keyboard action sequence).
ga: Seinn an macra reatha (i.e., forghníomhaigh an seicheamh gníomhaíochta méarchláir deireanach a taifeadadh).

source: Give a name to the current macro and persistently save it.
ga: Tabhair ainm don macra reatha agus sábháil go buan é.

source: &Load Named Macro...
ga: &Lódáil Macra Ainmnithe...

source: Load a named macro as the current one.
ga: Luchtaigh macra ainmnithe mar an ceann reatha.

source: &Play Named Macro...
ga: &Seinm Macra Ainmnithe...

source: Play a named macro without loading it.
ga: Seinn macra ainmnithe gan é a luchtú.

source: &Wipe Named Macro...
ga: &Scrios Macra Ainmnithe...

source: Wipe a named macro.
ga: Scrios macra ainmnithe.

source: End Macro &Recording
ga: Deireadh a chur le Macra & Taifeadadh

source: Load %1
ga: Luchtaigh %1

source: Load the '%1' macro as the current one.
ga: Luchtaigh an macra '%1' mar an ceann reatha.

source: Play %1
ga: Seinn %1

source: Play the '%1' macro without loading it.
ga: Seinn an macra '%1' gan é a luchtú.

source: Wipe %1
ga: Scrios %1

source: Wipe the '%1' macro.
ga: Scrios an macra '%1'.

source: Save current macro as?
ga: Sábháil an macra reatha mar?

source: Wipe the '%1' macro?
ga: Scrios an macra '%1'?

source: &Tools
ga: &Uirlisí
