Repository: C-EO/kate
Catalog: po/*/katefiletree.po
Languages: ga

source: Open...
ga: Oscail...

source: Open File
ga: Oscail Comhad

# @action:inmenu
source: Reloa&d
ga: Athló&dáil

source: Reload selected document(s) from disk.
ga: Athlódáil an doiciméad/na doiciméid roghnaithe ón diosca.

# @action:inmenu
source: Close
ga: Dún

source: Close the current document.
ga: Dún an doiciméad reatha.

# @action:inmenu
source: Expand Recursively
ga: Leathnaigh go hathchúrsach

source: Expand the file list sub tree recursively.
ga: Leathnaigh fo-chrann an liosta comhad go hathchúrsach.

# @action:inmenu
source: Collapse Recursively
ga: Laghdaigh go hathchúrsach

source: Collapse the file list sub tree recursively.
ga: Laghdaigh fo-chrann an liosta comhad go hathchúrsach.

# @action:inmenu
source: Close Other
ga: Dún Eile

source: Close other documents in this folder.
ga: Dún doiciméid eile sa bhfillteán seo.

# @action:inmenu
source: Open Containing Folder
ga: Oscail an Fillteán ina bhfuil

source: Open the folder this file is located in.
ga: Oscail an fillteán ina bhfuil an comhad seo suite.

# @action:inmenu
source: Copy Location
ga: Cóipeáil Suíomh

source: Copy path and filename to the clipboard.
ga: Cóipeáil an cosán agus ainm an chomhaid chuig an ghearrthaisce.

# @action:inmenu
source: Rename...
ga: Athainmnigh...

source: Rename the selected file.
ga: Athainmnigh an comhad roghnaithe.

source: Print selected document.
ga: Priontáil an doiciméad roghnaithe.

source: Show print preview of current document
ga: Taispeáin réamhamharc priontála den doiciméad reatha

# @action:inmenu
source: Delete
ga: Scrios

source: Close and delete selected file from storage.
ga: Dún agus scrios an comhad roghnaithe ón stóras.

# @action:inmenu
source: Tree Mode
ga: Mód Crann

source: Set view style to Tree Mode
ga: Socraigh stíl radhairc go Mód Crann

# @action:inmenu
source: List Mode
ga: Mód Liosta

source: Set view style to List Mode
ga: Socraigh stíl radhairc go Mód Liosta

# @action:inmenu sorting option
source: Document Name
ga: Ainm an Doiciméid

source: Sort by Document Name
ga: Sórtáil de réir Ainm an Doiciméid

# @action:inmenu sorting option
source: Document Path
ga: Cosán Doiciméid

source: Sort by Document Path
ga: Sórtáil de réir Chonair an Doiciméid

# @action:inmenu sorting option
source: Opening Order
ga: Ordú Oscailte

source: Sort by Opening Order
ga: Sórtáil de réir Ord Oscailte

source: Custom Sorting
ga: Sórtáil Saincheaptha

# @action:inmenu
source: Clear History
ga: Glan an Stair

source: Clear edit/view history.
ga: Glan stair eagarthóireachta/amhairc.

# @action:inmenu
source: Open With
ga: Oscail Le

source: Show Git History
ga: Taispeáin Stair Git

source: Unpin Document
ga: Díphionáil an Doiciméid

source: Pin Document
ga: Doiciméad bioráin

# @action:inmenu
source: View Mode
ga: Mód Amhairc

# @action:inmenu
source: Sort By
ga: Sórtáil De réir

source: Background Shading
ga: Scáthú Cúlra

source: &Viewed documents' shade:
ga: Scáth na ndoiciméad a breathnaíodh:

source: &Modified documents' shade:
ga: Scáth na ndoiciméad modhnaithe:

source: &Sort by:
ga: &Sórtáil de réir:

source: Opening Order
ga: Ordú Oscailte

source: Document Name
ga: Ainm an Doiciméid

source: &View Mode:
ga: Mód &Radharc:

source: Tree View
ga: Radharc Crann

source: List View
ga: Amharc Liosta

source: &Show Full Path
ga: &Taispeáin an Cosán Iomlán

source: Show &Toolbar
ga: Taispeáin an Barra Uirlisí

source: Show Close Button On Hovering
ga: Taispeáin an Cnaipe Dúnta agus tú ag luí

source: Middle Click To Close Documents
ga: Cliceáil Lárnach Chun Doiciméid a Dhúnadh

source: When background shading is enabled, documents that have been viewed or edited within the current session will have a shaded background. The most recent documents have the strongest shade.
ga: Nuair a bhíonn scáthú cúlra cumasaithe, beidh cúlra scáthaithe ag doiciméid a breathnaíodh nó a cuireadh in eagar laistigh den seisiún reatha. Bíonn an scáth is láidre ag na doiciméid is déanaí.

source: Set the color for shading viewed documents.
ga: Socraigh an dath le haghaidh scáthú na ndoiciméad a breathnaíodh.

source: Set the color for modified documents. This color is blended into the color for viewed files. The most recently edited documents get most of this color.
ga: Socraigh an dath do dhoiciméid mhodhnaithe. Cuirtear an dath seo le chéile leis an dath do chomhaid a breathnaíodh. Faigheann na doiciméid is déanaí a eagraíodh an chuid is mó den dath seo.

source: When enabled, in tree mode, top level folders will show up with their full path rather than just the last folder name.
ga: Nuair a bheidh sé cumasaithe, i mód crainn, taispeánfar fillteáin barrleibhéil lena gcosán iomlán seachas ainm an fhillteáin dheireanaigh amháin.

source: When enabled, a toolbar with actions like “Save” are displayed above the list of documents.
ga: Nuair a bhíonn sé cumasaithe, taispeántar barra uirlisí le gníomhartha cosúil le “Sábháil” os cionn liosta na ndoiciméad.

source: Documents
ga: Doiciméid

source: Configure Documents
ga: Cumraigh Doiciméid

# Open here is a description, i.e. 'list of widgets that are open' not a verb
source: Open Widgets
ga: Oscail Giuirléidí

# %1 is the full path
source: <p><b>%1</b></p><p>The document has been modified by another application.</p>
ga: <p><b>%1</b></p><p>Tá an doiciméad modhnaithe ag feidhmchlár eile.</p>

source: Filter…
ga: Scagaire…

source: Previous Document
ga: Doiciméad Roimhe Seo

source: Next Document
ga: An Chéad Doiciméad Eile

source: &Show Active Document
ga: &Taispeáin an Doiciméad Gníomhach

source: Save
ga: Sábháil

source: Save the current document
ga: Sábháil an doiciméad reatha

source: Save As
ga: Sábháil Mar

source: Save the current document under a new name
ga: Sábháil an doiciméad reatha faoi ainm nua

source: &Go
ga: &Téigh
