Repository: C-EO/kate
Catalog: po/*/katecompilerexplorer.po
Languages: fr, ga, nl, tr

source: Scroll to source
fr: Faire défiler jusqu'à la source
ga: Scrollaigh go dtí an fhoinse
nl: Naar broncode schuiven
tr: Kaynağa Sar

source: Jump to label
fr: Se positionner à l'étiquette
ga: Léim go dtí an lipéad
nl: Naar label springen
tr: Etikete Atla

source: Copy
fr: Copier
ga: Cóipeáil
nl: Kopiëren
tr: Kopyala

source: Select All
fr: Tout sélectionner
ga: Roghnaigh Uile
nl: Alles selecteren
tr: Tümünü Seç

source: Compiler Explorer
fr: Explorateur de compilateurs
ga: Taiscéalaí Tiomsaitheora
nl: Compiler-verkenner
tr: Derleyici Gezgini

source: &Open Current File in Compiler Explorer
fr: &Ouvrir le fichier courant dans l'explorateur de compilateurs
ga: &Oscail an Comhad Reatha in Taiscéalaí an Tiomsaitheora
nl: Huidig bestand in compiler-verkenner &openen
tr: Geçerli Dosyayı Derleyici Gezgininde &Aç

source: No file open
fr: Aucun fichier ouvert
ga: Níl aon chomhad oscailte
nl: Geen geopend bestand
tr: Açık dosya yok

# error category title
source: CompilerExplorer
ga: Taiscéalaí Tiomsaitheora
nl: Compiler-verkenner
tr: Derleyici Gezgini

source: Do you really want to close %1?
fr: Voulez-vous vraiment fermer %1 ?
ga: An bhfuil tú cinnte gur mhaith leat %1 a dhúnadh?
nl: Wilt u %1 sluiten?
tr: %1 ögesini kapatmayı gerçekten istiyor musunuz?

# @info:tooltip Languages like C, C++, Rust
source: Languages
ga: Teangacha

# @info:tooltip Compilers like GCC, Clang
source: Compilers
ga: Tiomsaitheoirí

# @info:placeholder
source: Compiler options…
ga: Roghanna tiomsaitheora…

source: Compile
fr: Compiler
ga: Tiomsú
nl: Compileren
tr: Derle

source: Options
ga: Roghanna
nl: Opties
tr: Seçenekler

source: Demangle Identifiers
fr: Décoder les identifiants
ga: Aitheantóirí Dí-Mhangla
nl: Identifiers ontwarren
tr: Tanımlayıcıları Ser

source: Filter Library Functions
fr: Filtrer les fonctions de bibliothèques
ga: Feidhmeanna Leabharlainne Scagaire
nl: Bibliotheekfuncties filteren
tr: Kitaplık İşlevlerini Süz

source: Filter Unused Labels
fr: Filtrer les étiquettes inutilisées
ga: Scag Lipéid Neamhúsáidte
nl: Ongebruikte labels filteren
tr: Kullanılmayan Etiketleri Süz

source: Filter Comments
fr: Filtrer les commentaires
ga: Scagaire Tráchtanna
nl: Commentaren filteren
tr: Yorumları Süz

source: Intel Syntax
fr: Syntaxe Intel
ga: Comhréir Intel
nl: Intel-syntaxis
tr: Akıllı Sözdizim

source: Change URL…
ga: Athraigh an URL…

source: Enter URL
ga: Cuir isteach URL

source: Enter URL for the CompilerExplorer instance, e.g. “http://localhost:10240”
ga: Cuir isteach URL don chás CompilerExplorer, m.sh. “http://localhost:10240”

source: Compiler returned: %1
fr: Le compilateur a renvoyé : %1
ga: An tiomsaitheoir a fuair ar ais: %1
nl: Compiler gaf terug: %1
tr: Derleyici şunu döndürdü: %1

source: Reveal linked code
fr: Révéler le code lié
ga: Nocht an cód nasctha
nl: Gekoppelde code onthullen
tr: Bağlantılı Kodu Ortaya Çıkar

source: CompilerExplorer
ga: Taiscéalaí Tiomsaitheora
nl: Compiler-verkenner
tr: Derleyici Gezgini

source: '%1' compiler flags were found. Output may not be useful.
fr: Les étiquettes « %1 » de compilateur ont été trouvés. La sortie pourrait ne pas être utile.
ga: Fuarthas bratacha tiomsaitheora '%1'. B’fhéidir nach mbeidh an t-aschur úsáideach.
nl: '%1' compiler-vlaggen zijn gevonden. Uitvoer kan niet nuttig zijn.
tr: “%1” derleyici bayrağı bulundu. Çıktı yararlı olabilir.
