Repository: C-EO/kate
Catalog: po/*/ktexteditorpreviewplugin.po
Languages: ga, nb

source: Preview
ga: Réamhamharc
nb: Forhåndsvisning

source: Lock Current Document
ga: Glasáil an Doiciméad Reatha
nb: Lås gjeldende dokument

source: Lock preview to current document
ga: Glasáil réamhamharc don doiciméad reatha
nb: Lås forhåndsvisning på gjeldende dokument

source: Unlock Current View
ga: Díghlasáil an Amharc Reatha
nb: Lås opp gjeldende visning

source: Unlock current view
ga: Díghlasáil an amharc reatha
nb: Lås opp gjeldende visning

source: Automatically Update Preview
ga: Nuashonraigh Réamhamharc go hUathoibríoch
nb: Oppdater forhåndsvisning automatisk

source: Enable automatic updates of the preview to the current document content
ga: Cumasaigh nuashonruithe uathoibríocha an réamhamhairc ar ábhar an doiciméid reatha
nb: Slå på automatisk oppdatering av forhåndsvisningen av innholdet i det gjeldende dokumentet

source: Manually Update Preview
ga: Réamhamharc Nuashonraithe de Láimh
nb: Oppdater forhåndsvisning manuelt

source: Disable automatic updates of the preview to the current document content
ga: Díchumasaigh nuashonruithe uathoibríocha an réamhamhairc ar ábhar an doiciméid reatha
nb: Slå av automatisk oppdatering av forhåndsvisningen av innholdet i det gjeldende dokumentet

source: Update Preview
ga: Réamhamharc Nuashonraithe
nb: Oppdater forhåndsvisning

source: Update the preview to the current document content
ga: Nuashonraigh an réamhamharc go dtí ábhar an doiciméid reatha
nb: Oppdater forhåndsvisningen av innholdet i det gjeldende dokumentet

source: View
ga: Amharc
nb: Vis

source: No preview available.
ga: Níl aon réamhamharc ar fáil.
nb: Ingen forhåndsvisning tilgjengelig.

source: About %1
ga: Maidir le %1
nb: Om %1
