Repository: C-EO/kate
Catalog: po/*/lspclient.po
Languages: ga

source: Filter…
ga: Scagaire…

source: LSP Client
ga: Cliant LSP

source: No JSON data to validate.
ga: Gan aon sonraí JSON le bailíochtú.

source: JSON data is valid.
ga: Tá sonraí JSON bailí.

source: JSON data is invalid: no JSON object
ga: Tá sonraí JSON neamhbhailí: níl aon réad JSON ann

source: JSON data is invalid: %1
ga: Tá sonraí JSON neamhbhailí: %1

source: Delete selected entries
ga: Scrios na hiontrálacha roghnaithe

source: Delete all entries
ga: Scrios gach iontráil

source: LSP server start requested
ga: Iarradh tús a chur le freastalaí LSP

source: Do you want the LSP server to be started?<br><br>The full command line is:<br><br><b>%1</b><br><br>The choice can be altered via the config page of the plugin.
ga: Ar mhaith leat an freastalaí LSP a thosú?<br><br>Seo an líne ordaithe iomlán:<br><br><b>%1</b><br><br>Is féidir an rogha a athrú tríd an leathanach cumraíochta den bhreiseán.

source: User permanently blocked start of: '%1'. Use the config page of the plugin to undo this block.
ga: Úsáideoir blocáilte go buan ag tús: '%1'. Úsáid leathanach cumraíochta an bhreiseáin chun an blocáil seo a chealú.

source: Go to Definition
ga: Téigh go dtí an Sainmhíniú

source: Go to Declaration
ga: Téigh go dtí an Dearbhú

source: Go to Type Definition
ga: Téigh go dtí Sainmhíniú Cineál

source: Find References
ga: Aimsigh Tagairtí

source: Find Implementations
ga: Aimsigh Cur i bhFeidhm

source: Highlight
ga: Aibhsigh

source: Symbol Info
ga: Eolas Siombail

source: Search and Go to Symbol
ga: Cuardaigh agus Téigh go Siombail

source: Format
ga: Formáid

source: Rename
ga: Athainmnigh

source: Expand Selection
ga: Leathnaigh an Roghnú

source: Shrink Selection
ga: Laghdaigh an Roghnú

source: Switch Source Header
ga: Ceanntásc Foinse Athraigh

source: Expand Macro
ga: Macra Leathnaigh

source: Code Action
ga: Gníomh Cód

source: Show lsp completions
ga: Taispeáin críochnaithe lsp

source: Show selected completion documentation
ga: Taispeáin an doiciméadacht críochnaithe roghnaithe

source: Enable signature help with auto completion
ga: Cumasaigh cabhair le síniú le comhlánú uathoibríoch

source: Include declaration in references
ga: Cuir dearbhú san áireamh sna tagairtí

source: Add parentheses upon function completion
ga: Cuir lúibíní leis nuair a bheidh an fheidhm críochnaithe

source: Show hover information
ga: Taispeáin faisnéis luiche

source: Format on typing
ga: Formáid ar chlóscríobh

source: Incremental document synchronization
ga: Sioncrónú doiciméad incriminteach

source: Highlight goto location
ga: Aibhsigh suíomh goto

source: Show Inlay Hints
ga: Taispeáin Leideanna Inleagain

source: Show Diagnostics Notifications
ga: Taispeáin Fógraí Diagnóisice

source: Show Messages
ga: Taispeáin Teachtaireachtaí

source: Server Memory Usage
ga: Úsáid Cuimhne Freastalaí

source: Close All Dynamic Reference Tabs
ga: Dún Gach Cluaisín Tagartha Dinimiciúil

source: Restart LSP Server
ga: Atosaigh Freastalaí LSP

source: Restart All LSP Servers
ga: Atosaigh Gach Freastalaí LSP

source: Suspend All
ga: Cuir ar Fionraí Gach Rud

source: Go To
ga: Téigh Chuig

source: More options
ga: Tuilleadh roghanna

source: Expand All
ga: Leathnaigh Uile

source: Collapse All
ga: Laghdaigh Gach Rud

source: RangeHighLight
ga: Buaicphointe Raoin

source: Line: %1:
ga: Líne: %1:

source: No results
ga: Gan aon torthaí

# @title:tab
source: Definition: %1
ga: Sainmhíniú: %1

# @title:tab
source: Declaration: %1
ga: Dearbhú: %1

# @title:tab
source: Type Definition: %1
ga: Sainmhíniú Cineál: %1

# @title:tab
source: References: %1
ga: Tagairtí: %1

# @title:tab
source: Implementation: %1
ga: Cur i bhFeidhm: %1

# @title:tab
source: Highlight: %1
ga: Aibhsigh: %1

source: No Actions
ga: Gan Gníomhartha

source: Loading...
ga: Ag lódáil...

source: No edits
ga: Gan aon eagarthóireacht

# @title:window
source: Rename
ga: Athainmnigh

# @label:textbox
source: New name (caution: not all references may be replaced)
ga: Ainm nua (rabhadh: ní féidir gach tagairt a athsholáthar)

source: Not enough results
ga: Gan dóthain torthaí

source: Corresponding Header/Source not found
ga: Ceanntásc/Foinse Chomhfhreagrach gan aimsiú

# @info
source: LSP Server
ga: Freastalaí LSP

# @info
source: LSP Client
ga: Cliant LSP

source: Question from LSP server
ga: Ceist ó fhreastalaí LSP

source: Restarting
ga: Atosú

source: NOT Restarting
ga: GAN Atosú

source: Server terminated unexpectedly ... %1 [%2] [homepage: %3]
ga: Foirceannadh an fhreastalaí gan choinne ... %1 [%2] [leathanach baile: %3]

source: Failed to find server binary '%1' for language '%2'
ga: Theip ar an mbínéir freastalaí '%1' a aimsiú don teanga '%2'

source: Please check your PATH for the binary
ga: Seiceáil do PATH le haghaidh an chomhaid dhénártha le do thoil

source: See also %1 for installation or details
ga: Féach freisin %1 le haghaidh suiteáil nó sonraí

source: Failed to start server '%1' for language '%2'
ga: Theip ar thosú freastalaí '%1' don teanga '%2'

source: Started server %2: %1
ga: Freastalaí %2 tosaithe: %1

source: Failed to parse server configuration '%1': no JSON object
ga: Theip ar chumraíocht an fhreastalaí '%1' a pharsáil: níl aon réad JSON ann

source: Failed to parse server configuration '%1': %2
ga: Theip ar chumraíocht an fhreastalaí '%1' a pharsáil: %2

source: Failed to read server configuration: %1
ga: Theip ar chumraíocht an fhreastalaí a léamh: %1

# @action
source: Go to next symbol highlight
ga: Téigh go dtí an chéad aibhsiú siombaile eile

# @action
source: Go to previous symbol highlight
ga: Téigh go dtí an siombail roimhe seo a aibhsiú

source: Symbol Outline
ga: Imlíne Siombail

source: Tree Mode
ga: Mód Crann

source: Automatically Expand Tree
ga: Leathnaigh an Crann go hUathoibríoch

source: Sort Alphabetically
ga: Sórtáil in ord aibítre

source: Show Details
ga: Taispeáin Sonraí

source: Symbols
ga: Siombailí

source: LSP server does not support symbol outline.
ga: Ní thacaíonn freastalaí LSP le himlíne siombailí.

source: No LSP server for this document.
ga: Níl aon fhreastalaí LSP ann don doiciméad seo.

source: Client Settings
ga: Socruithe Cliant

source: Format on save
ga: Formáidigh ar shábháil

source: Enable semantic highlighting
ga: Cumasaigh aibhsiú séimeantach

source: Enable inlay hints
ga: Cumasaigh leideanna inleagain

source: Completions:
ga: Críochnuithe:

source: Show completions
ga: Taispeáin críochnaithe

source: Show inline docs for selected completion
ga: Taispeáin doiciméid inlíne don chomhlánú roghnaithe

source: Show function signature when typing a function call
ga: Taispeáin síniú feidhme agus glao feidhme á chlóscríobh

source: Add imports automatically if needed upon completion
ga: Cuir allmhairí leis go huathoibríoch más gá nuair a bheidh siad críochnaithe

source: Navigation:
ga: Loingseoireacht:

source: Count declarations when searching for references to a symbol
ga: Dearbhuithe a chomhaireamh agus tagairtí do shiombail á gcuardach

source: Show information about currently hovered symbol
ga: Taispeáin faisnéis faoin tsiombail atá ag luí faoi láthair

source: Highlight target line when hopping to it
ga: Aibhsigh an líne sprice agus tú ag léim chuici

source: Server:
ga: Freastalaí:

source: Show program diagnostics
ga: Taispeáin diagnóisic chláir

source: Show notifications from the LSP server
ga: Taispeáin fógraí ón bhfreastalaí LSP

source: Incrementally synchronize documents with the LSP server
ga: Sioncrónaigh doiciméid de réir a chéile leis an bhfreastalaí LSP

source: Document outline:
ga: Achoimre ar an doiciméad:

source: Sort symbols alphabetically
ga: Sórtáil siombailí in ord aibítre

source: Display additional details for symbols
ga: Taispeáin sonraí breise le haghaidh siombailí

source: Present symbols in a hierarchy instead of a flat list
ga: Cuir siombailí i láthair in ordlathas seachas liosta comhréidh

source: Automatically expand tree
ga: Leathnaigh an crann go huathoibríoch

source: Highlight symbol under cursor
ga: Aibhsigh an tsiombail faoin gcúrsóir

source: Allowed && Blocked Servers
ga: Freastalaithe Ceadaithe & Blocáilte

source: User Server Settings
ga: Socruithe Freastalaí Úsáideora

source: Settings File:
ga: Comhad Socruithe:

source: Default Server Settings
ga: Socruithe Réamhshocraithe Freastalaí

source: &LSP Client
ga: Cliant &LSP

source: More Options
ga: Tuilleadh Roghanna
